tutorials/combustion/dieselFoam/aachenBomb/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cmix            Cmix [ 0 0 0 0 0 0 0 ] 1;

ignitionProperties1
{
    ignite          off;
    ignitionPoint   ignitionPoint [ 0 1 0 0 0 0 0 ] ( 0.2 0 0.02 );
    timing          timing [ 0 0 1 0 0 0 0 ] 0;
    duration        duration [ 0 0 1 0 0 0 0 ] 1;
}

// ************************************************************************* //
